[
    {
        "DESIGN_INSIGHT": "### DESIGN_INSIGHT_HIGH: [Content-Adaptive Multiscale Spatio-Temporal Embedding and Decoding (CAM-STD) with Per-Bit WeightNet Fusion]\nDVMark replaces single-scale, per-frame watermarking architectures with a multiscale 3D encoder–decoder that distributes bits across spatial-temporal scales and fuses them adaptively at decode time. Instead of embedding in a fixed transform domain (e.g., DWT/DCT) or independently per image frame, DVMark learns a video-aware transform and embeds across two spatial-temporal scales, then decodes via multi-head 3D branches fused by a content-adaptive, per-bit weighting network.\n\nKey mechanisms:\n- Encoder learns a 3D transform via stacked Conv3D layers and outputs a residual watermark R that is added to the cover video with adjustable strength α:\n  V_w = V_in + α R.\n  The binary message M ∈ {0,1}^m is spatial-temporally tiled to T×H×W×m and concatenated with features at two scales S1 and S2, with down/up-sampling between scales to distribute redundancy across space and time.\n- Decoder shares a learned 3D transform and uses two decoder heads producing per-scale decoded volumes D_i with the same channel dimension m as the payload. After global average pooling, each head yields E_i ∈ ℝ^m. A per-video WeightNet predicts a normalized weight matrix W ∈ ℝ^{m×2}, and the final logits combine per-bit, per-scale evidence:\n  \\hat{M} = W^⊤ E, where E = [E_1, E_2]^⊤.\n  This per-bit fusion learns which scale better preserves each bit under the encountered distortions and content statistics.\n\nFundamental differences from prior work:\n- Unlike deep image watermarking (e.g., HiDDeN) that ignores temporal structure, CAM-STD leverages 3D spatio-temporal features, explicitly balancing temporal redundancy (robust to frame drop/swap/average) with spatial redundancy (robust to crop/blur).\n- Unlike traditional frequency-domain video watermarking (e.g., 3D-DWT), the transform is learned end-to-end and not tied to a fixed codec or band-selection rule, allowing content-adaptive distribution across scales and per-bit weighting learned from data.\n- The per-bit, per-scale fusion W replaces fixed late fusion with a learned, content-conditioned mixture-of-experts over scales, improving robustness without increasing inference complexity beyond two Conv3D heads and a small 3D CNN for W.\n\nMathematically, the end-to-end objective jointly optimizes imperceptibility and decoding with an adversarial term:\nL_total = L_I(V_in, V_w) + c_1 L_M(M, \\hat{M}) + c_2 L_G(V_w),\nwhere L_I is pixel L2, L_M is sigmoid cross-entropy on bit logits \\hat{M}, and L_G is a GAN hinge-loss term for temporal realism (see discriminator insight). CAM-STD effectively translates multiresolution transform ideas into a learned 3D, content-adaptive, per-bit fusion pipeline.\n\n\n### DESIGN_INSIGHT_MEDIUM: [CompressionNet – Differentiable 3D Codec Proxy for End-to-End Robustness to H.264]\nDVMark replaces non-differentiable video compression in the training loop with a learned, differentiable proxy, enabling true end-to-end backpropagation of robustness to compression artifacts. Rather than hand-crafted frequency damping or image-level differentiable JPEG, CompressionNet is a 3D CNN trained to mimic H.264 with inter-frame effects.\n\nKey mechanism:\n- Learn a proxy operator \\hat{\\mathcal{C}}_φ that approximates the true codec \\mathcal{C} (H.264 at a fixed CRF) by minimizing\n  L_comp(φ) = || \\hat{\\mathcal{C}}_φ(V) − \\mathcal{C}(V) ||_2^2\n  over video clips V. The trained proxy achieves ≈33.3 dB PSNR to H.264 at CRF=25.\n- During watermark training, the distortion layer samples from multiple differentiable distortions and includes \\hat{\\mathcal{C}}_φ, allowing gradients to flow through compression, so encoder–decoder parameters directly learn invariances to compression artifacts.\n\nFundamental differences from prior approaches:\n- Traditional robustness relies on embedding in mid/low-frequency subbands; however, real codecs combine motion compensation, prediction, quantization, and in-loop filtering that are not captured by simple frequency truncation or 2D JPEG approximations.\n- Prior deep watermarking works often use image-level differentiable JPEG; CompressionNet is a video-aware 3D proxy that captures temporal dependencies (e.g., inter-frame prediction), making robustness training aligned with actual video codec behavior.\n\nFormally, the overall optimization becomes\nmin_{θ_enc, θ_dec} 𝔼_{V,M,𝔻} [ L_I + c_1 L_M + c_2 L_G ],\nwhere 𝔻 includes stochastic differentiable transforms plus \\hat{\\mathcal{C}}_φ. This turns an otherwise bilevel or REINFORCE-like problem (due to non-differentiable codec) into standard SGD, improving robustness to H.264 without additional inference cost.\n\n\n### DESIGN_INSIGHT_MEDIUM: [Dual-Task Decoder with Shared 3D Features for Frame-Level Watermark Detection in Mixed-Content Videos]\nDVMark augments the decoder with a parallel detector head that predicts whether each frame (or short segment) is watermarked, enabling selective decoding in videos that mix watermarked and unwatermarked content (e.g., edits, overlays). This replaces the assumption of uniform watermark presence with an explicit, learnable detection task sharing the same 3D feature backbone as the decoder.\n\nKey mechanism:\n- Given shared transform features D_f = T_ψ(V_d), the detector head outputs per-frame logits p_t = σ(h(D_f)_t), trained with binary cross-entropy by sampling clips watermarked with probability 0.5 under the same distortion set. At inference, frames with p_t below a threshold are filtered out before decoding, i.e., E[D_i | p_t ≥ τ], improving bit accuracy when the watermarked portion is sparse.\n- The detector uses Conv2D layers over spatially pooled 3D features, providing temporal sensitivity through D_f while maintaining lightweight per-frame decisions.\n\nFundamental differences from prior watermarking:\n- Traditional and deep watermarking systems focus on decoding assuming fully watermarked media. DVMark’s dual-task design explicitly models real-world edits by detecting watermarked segments, preventing unwatermarked frames from corrupting the bit vote.\n- The shared 3D backbone amortizes computation and enforces feature consistency between detection and decoding, improving temporal localization without extra passes.\n\nThis architectural addition is orthogonal to the encoder/decoder and compression proxy; together they yield a practical pipeline where detection gates decoding: given detector mask m_t = 𝟙[p_t ≥ τ], the final bit logits aggregate only over selected frames, which empirically maintains high accuracy even when the watermarked area is <1% of total pixels in long videos.",
        "EXPERIMENTAL_TRIGGER_PATTERNS": "Task_Performance_Signatures:\n- Kinetics-600 video watermarking (8×128×128 clips, payload m=96 bits)\n  - Expect improved bit accuracy versus strong baselines across diverse distortions:\n    - Identity: ~99.99% (HiDDeN 99.10%, 3D-DWT 99.69%)\n    - H.264 CRF=22: ~92.94% (HiDDeN 79.85%, 3D-DWT 89.29%)\n    - Frame average N=3: ~98.10% (HiDDeN 96.91%, 3D-DWT 96.78%)\n    - Frame drop p=0.5: ~98.99% (HiDDeN 99.03%, 3D-DWT 79.85%)\n    - Frame swap p=0.5: ~99.35% (HiDDeN 99.10%, 3D-DWT 90.15%)\n    - Gaussian blur σ=2.0: ~98.09% (HiDDeN 72.70%, 3D-DWT 92.78%)\n    - Gaussian noise std=0.04: ~98.56% (HiDDeN 91.27%, 3D-DWT 99.01%)\n    - Random crop ratio p=0.4: ~97.06% (HiDDeN 95.27%, 3D-DWT 71.38%)\n    - Random hue 1.0: ~99.81% (HiDDeN 98.98%, 3D-DWT 99.59%)\n  - Overall average accuracy across distortions: ~98.10% (HiDDeN 92.47%, 3D-DWT 90.95%)\n- Quality metrics at payload m=96 (higher is better except LPIPS/tLP)\n  - PSNR: ~37.0 dB (HiDDeN 35.5 dB, 3D-DWT 36.5 dB)\n  - MSSIM: ~0.985 (HiDDeN 0.962, 3D-DWT 0.983)\n  - LPIPS×100: ~5.70 (HiDDeN 8.92, 3D-DWT 8.79), lower indicates better perceptual quality\n  - tLP×100 (temporal consistency): ~0.160 (HiDDeN 0.354, 3D-DWT 0.628), indicating ~2.2–3.9× lower temporal flicker\n  - MOS (“same” judgments): ~0.92 (HiDDeN 0.86, 3D-DWT 0.90)\n- Robustness versus distortion strength (qualitative targets from reported curves)\n  - Frame drop: maintain ~99% up to p≈0.5; degrades beyond 0.5; still clearly above 3D-DWT\n  - H.264: ~96–97% at CRF≈20, ~93% at CRF=22, gradually decreasing toward mid-80%s by CRF≈26\n  - Gaussian blur/noise: stable high-90%s across typical ranges used in evaluation; slight drop at strongest settings\n- Payload–robustness trade-off at fixed visual quality (~37 dB PSNR target)\n  - Average bit accuracy across four representative distortions (H.264, crop, frame drop, Gaussian noise):\n    - 64 bits: ~98.02%\n    - 80 bits: ~97.44%\n    - 96 bits: ~96.55%\n    - 112 bits: ~93.90%\n    - 128 bits: ~90.30%\n  - Interpretation: expect graceful degradation with payload; remains >90% up to 128 bits at ~37 dB\n- Scaling to longer/larger videos (applied fully convolutionally, segment size T=8)\n  - Average decoding accuracy across four distortions for resolutions {128×128, 462×240, 864×480} and lengths T∈{8,16,32,64}: ~95–97% with no degradation as length increases; minor resolution-dependent variations per distortion\n  - Per-distortion examples (462×240):\n    - H.264 CRF=22: ~92.25–93.20% for T=8–64\n    - Crop p=0.4: ~98.77–98.90%\n    - Frame drop p=0.5: ~96.95–98.09%\n    - Gaussian noise 0.04: ~98.53–98.60%\n- Watermark detector performance and downstream benefit\n  - Detector accuracy averaged over distortions: ~98.32% (e.g., H.264 CRF=22: 94.27%; frame drop p=0.5: 99.75%)\n  - Edited-video setting (16 watermarked frames inserted into long unwatermarked background at 462×240):\n    - Decoding accuracy with detector filtering vs without at background length:\n      - T=60: 99.62% vs 85.19%\n      - T=120: 98.81% vs 75.31%\n      - T=240: 98.50% vs 68.40%\n      - T=360: 95.32% vs 51.08%\n      - T=720: 90.02% vs 52.14%\n  - Signature: sharp confidence spike aligned to the true watermarked segment; threshold 0.3 effective for filtering\n- Compression proxy effectiveness (CompressionNet)\n  - CompressionNet trained to mimic H.264 (CRF=25) reaches ~33.3 dB PSNR to true codec output\n  - Training with CompressionNet raises H.264 robustness (test under real codec) from ~53.5% (no proxy) to ~89.3%; combining with other differentiable distortions reaches ~93.0%\n- Multiscale decoder/head weighting gain\n  - Average accuracy across tested distortions:\n    - Single head: ~94.2–94.5%\n    - Two heads (unweighted sum): ~96.47%\n    - Two heads + WeightNet: ~96.62%\n  - Expect +2.0–2.5 percentage point gain from multiscale fusion with data-dependent weights\n- Content dependence\n  - Histogram over 200 clips with added noise (std=0.06): majority >90% bit accuracy; failure cases correlate with very low texture/low motion content; expect higher accuracy on “richer” scenes\n\nArchitectural_Symptoms:\n- Training characteristics and stability\n  - With distortion-layer sampling (10 distortions, equal probability) + hinge-GAN with spectral normalization, observe smooth joint convergence of:\n    - Pixel L2 loss (quality) toward ~37 dB PSNR at α≈1.0\n    - Sigmoid cross-entropy (message loss) to near-zero; decoding accuracy approaches >98% on identity and high-90%s on common distortions\n  - Multiscale encoder–decoder shows improved stability and robustness versus single-scale (≈+2 pp accuracy); removing a head or WeightNet reduces robustness\n  - No NaN/divergence with Adam (lr 1e-4, 3M steps for enc/dec) under reported setup; discriminator run 2× per generator step stabilizes training\n- Temporal consistency and perceptual signatures\n  - 3D video discriminator reduces temporal flicker:\n    - tLP×100 around ~0.160; replacing with 2D discriminator or disabling GAN (c2=0) noticeably increases temporal artifacts and yields noisier residuals\n  - Symmetric padding removes temporal/spatial boundary artifacts; switching to zero/constant padding causes visible boundary differences and higher tLP\n- Compression proxy behavior\n  - CompressionNet gradients flow end-to-end; training loss against proxy converges; when substituted by simple blurs or differentiable JPEG, H.264 robustness plateaus lower (≈72–78% vs ≈89–93%), indicating proxy mismatch\n  - Proxy calibration check: PSNR of proxy output to real H.264 remains ~33 dB during/after training\n- Runtime/memory and deployment patterns\n  - 3D Conv-based encoder/decoder scales approximately linearly with T, H, W in memory and compute; practical training reported at batch size 6 with 8×128×128 clips\n  - Inference applied in temporal chunks (every 8 frames) yields constant-memory behavior versus full-length videos and maintains throughput; no OOM at long durations when chunked\n  - Fully convolutional in space: throughput scales with resolution; accuracy stable for tested resolutions (128×128 to 864×480); mild distortion-dependent variations (e.g., H.264 slightly harder at highest resolution)\n- Parameter sensitivity signatures\n  - Watermark strength α:\n    - Increasing α boosts robustness but reduces PSNR; decreasing α increases PSNR but lowers bit accuracy; curves should be monotonic in both directions\n  - Loss weights:\n    - Raising c1 (message loss) increases accuracy (e.g., from ~85% to ~99%) at the expense of PSNR (e.g., ~39 dB to ~34 dB)\n    - Non-zero c2 (GAN weight, e.g., 2e-3 to 4e-3) reduces perceptual noise and tLP; c2=0 leads to visibly noisier residuals and higher flicker\n- Detector head behavior\n  - When working: per-frame detector logits exhibit a distinct plateau near 1.0 over watermarked segments and near 0 elsewhere, robust under common distortions (≥94% accuracy under H.264 CRF=22)\n  - Downstream symptom: applying detector-based filtering before decoding materially increases message recovery on long edited videos (gains of 15–40+ percentage points depending on background length)\n- Negative/neutral indicators\n  - Extreme distortions beyond training range (e.g., frame drop >0.6–0.7, very high CRF) show expected accuracy decay\n  - Slightly trailing 3D-DWT under strong Gaussian noise in some settings (difference ~0.5 pp at std=0.04), while dominating other distortions\n  - Low-texture, low-motion clips produce the lower tail in accuracy histograms; expect improvement by increasing α or weighting coarser decoder scales (WeightNet emphasis)",
        "BACKGROUND": "Title: DVMark: A Deep Multiscale Framework for Video Watermarking\n\nHistorical Technical Context:\nDigital watermarking began in the signal-processing era with spatial-domain bit-plane methods (e.g., LSB), transform-domain embedding using DFT/DCT/DWT/DT-CWT, and compression-domain techniques tightly coupled to codecs such as H.264/AVC. Robustness was typically pursued by embedding in mid–low frequency coefficients and by perceptual masking guided by Human Visual System models, while security and capacity were traded against imperceptibility. For videos, 3D transforms (e.g., 3D-DWT) and spread-spectrum embedding across sub-bands were standard to leverage spatio-temporal redundancy.\n\nDeep learning subsequently advanced image watermarking via CNN encoder–decoder architectures trained end-to-end with differentiable distortion layers, adversarial perceptual losses, and explicit robustness targets (e.g., HiDDeN, StegaStamp, differentiable JPEG or camera pipelines). However, directly extending image models to video often ignored temporal correlation, leading to temporal flicker, reduced robustness under temporal perturbations (frame drop, swap, averaging), and weak adaptation to non-differentiable codecs. In video generation, multi-scale 3D CNN discriminators (e.g., TGAN2) and spectral normalization stabilized adversarial training and improved temporal consistency, suggesting a path for video watermarking to incorporate temporal modeling, multiscale features, and adversarial objectives.\n\nThe problem space evolved from single-distortion robustness to broad-spectrum resilience across spatial (crop, blur, hue/saturation), temporal (drop, swap, average, shift), and codec distortions, alongside scalability to arbitrary resolutions and lengths. Practical workflows also introduced mixed-content scenarios where only subsets of frames are watermarked (e.g., edited-in segments), motivating integrated detection mechanisms to localize watermarked intervals prior to decoding.\n\nTechnical Limitations:\n- Limited cross-distortion robustness of traditional transform/compression-domain methods: Handcrafted embedding tailored to specific transformations lacks generalization to heterogeneous distortions (e.g., crop or frame-level edits), resulting in sharp accuracy degradation outside the design space.\n- Non-differentiability of real video codecs: Motion estimation, quantization, and entropy coding in standards like H.264/AVC break gradient flow, preventing true end-to-end training. Prior 2D proxies (e.g., differentiable JPEG) ignore inter-frame dependencies, producing large approximation error for temporal compression.\n- Per-frame deep image watermarking for videos: Treating frames independently forfeits temporal redundancy and causes sub-optimal robustness–quality–payload trade-offs, evident under blur/compression and temporal transforms. It also yields temporal inconsistency (flicker) without video-aware constraints.\n- Instability and temporal artifacts without video-aware discriminators: 2D GAN discriminators focus on spatial realism, neglecting temporal coherence; this can lead to frame-to-frame inconsistency and visible watermark noise patterns.\n- Mixed-content decoding failure: In edited videos containing both watermarked and unwatermarked content, global decoding collapses due to label dilution, severely reducing bit accuracy unless frames are first localized as watermarked.\n- Scaling to varied resolutions and lengths: Architectures fixed to training dimensions may overfit to short clips (e.g., T=8) and low resolutions; without careful design, computational and memory growth for 3D operators scales as O(T H W C k^3), impeding deployment on long/high-resolution videos.\n\nPaper Concepts:\n- Multiscale Spatio-Temporal Embedding (Encoder):\n  The encoder maps a cover video block Vin ∈ R^{t×h×w×3} and a binary message M ∈ {0,1}^m to a watermarked video via a learned residual:\n  Vw = Vin + α R(Vin, M),\n  where α ∈ R^+ controls watermark strength. A 3D transform layer T(·) produces features F = T(Vin), and the message is spatial-temporally repeated M̃ ∈ R^{t×h×w×m} and concatenated with features at two scales S1, S2. The high-level embeds via stacked Conv3D at each scale with down/up-sampling between scales, yielding a residual R. Intuitively, distributing bits across scales and time provides redundancy against spatial and temporal distortions while preserving imperceptibility.\n\n- Multi-head Decoder with Content-adaptive Weighting (WeightNet):\n  Given a possibly distorted video Vd, a transform layer yields shared features Df. Two decoder heads produce decoded tensors D1, D2 aligned to S1, S2; after global average pooling,\n  E1, E2 ∈ R^m, E = [E1; E2] ∈ R^{2×m}.\n  WeightNet predicts a per-video normalized weight matrix W ∈ R^{2×m} (row-wise softmax), and the final decoded message vector is\n  M^w = W^T E,\n  i.e., for bit j, M^w_j = ∑_{i=1}^2 W_{ij} E_{ij}. This adaptively emphasizes scales best preserving each bit under the encountered content and distortion.\n\n- Differentiable Distortion Layer (Training-time Augmentation):\n  Robustness is obtained by minimizing expected loss over a distribution of differentiable distortions d ∼ 𝔇:\n  minimize_{θ} 𝔼_{d∼𝔇}[ L(Vin, M; θ, d) ],\n  where θ denotes encoder–decoder parameters. Spatial-temporal perturbations include random frame drop/swap/shift, crop, hue/saturation jitter, 3D Gaussian blur, Gaussian noise, differentiable JPEG, and a differentiable compression proxy. Sampling one distortion per step encourages invariance across a broad spectrum.\n\n- CompressionNet (Differentiable Proxy for H.264):\n  A 3D-CNN C_ϕ(·) is trained to approximate H.264 at a fixed Constant Rate Factor:\n  ϕ* = argmin_ϕ 𝔼[ || C_ϕ(V) − H(V; CRF) ||_2^2 ].\n  Once trained (PSNR ≈ 33.3 dB to true H.264 at CRF=25), C_ϕ is fixed as a differentiable distortion in the training loop. Because C_ϕ uses spatio-temporal kernels and down/up-sampling, it captures inter-frame compression effects ignored by 2D JPEG surrogates.\n\n- Multiscale Video Discriminator with Hinge Loss:\n  A TGAN2-style 3D multi-resolution discriminator D processes inputs at several temporal/spatial scales via residual 3D blocks. With spectral normalization, the Hinge objectives are\n  LD = max(0, 1 − D(Vw)) + max(0, 1 + D(Vin)),  LG = −D(Vw).\n  Adding LG to the encoder–decoder loss improves temporal consistency and reduces flicker by enforcing spatio-temporal realism in the watermarked video.\n\n- Watermark Detector Head (Mixed-content Localization):\n  A detector shares Df and applies Conv2D followed by global pooling to predict y ∈ [0,1] per clip/frame indicating watermark presence, optimized with sigmoid cross-entropy. At inference, frames with y < τ are filtered before decoding. In edited videos containing small watermarked inserts, this pre-filtering drastically improves decoding accuracy.\n\nExperimental Context:\nThe evaluation primarily targets robustness (bit recovery) under diverse, realistic video distortions while preserving perceptual fidelity and temporal consistency. The core metric is bit accuracy (percentage of correctly decoded bits) across: H.264 compression (e.g., CRF=22), spatial crop, Gaussian blur/noise, hue/saturation jitter, frame drop/swap/average/shift, and the CompressionNet transform. Quality is measured by PSNR, MSSIM, LPIPS, and a temporal perceptual metric tLP; perceptual realism is further probed via a user study (MOS). Trade-offs among robustness, visual quality, and payload are explored by varying watermark strength α and message length m.\n\nTraining uses Kinetics-600 video clips (8×128×128), payload m=96 bits, and a single randomly sampled distortion per step. The total loss combines pixel L2, message loss, and GAN generator loss:\nLtotal = LI(Vin, Vw) + c1 LM(M, M^w) + c2 LG(Vw).\nBaselines include a traditional 3D-DWT spread-spectrum scheme and HiDDeN (image watermarking) applied per frame. DVMark achieves higher average bit accuracy across distortions (e.g., average 98.10% vs 92.47% HiDDeN and 90.95% 3D-DWT; H.264 CRF=22: 92.94% vs 79.85% and 89.29%), while maintaining superior quality (PSNR 37.0 dB, MSSIM 0.985, LPIPS×100 = 5.70, tLP×100 = 0.160, MOS 0.92). Robustness–quality curves (varying α) and robustness–payload curves (varying m, with PSNR ≈ 37 dB) show DVMark dominating baselines across operating points. Scalability tests apply the model fully-convolutionally to higher resolutions (e.g., 462×240, 864×480) and longer durations (T up to 64) with consistent average decoding accuracy ≈ 96–97% across distortions. In a video-editing scenario with a short watermarked insert (16 frames) occupying as little as 0.5% of total pixels, the detector boosts decoding from ≈ 52% to ≈ 90% at T=720 by filtering unwatermarked frames before decoding, demonstrating practicality in real workflows.",
        "ALGORITHMIC_INNOVATION": "Core_Algorithm:\n- Replace per-frame image watermarking with a spatio-temporal, multiscale 3D-CNN pipeline that embeds a binary message across multiple spatial-temporal scales and decodes it with multi-head fusion. The encoder learns a residual watermark R that is added to the cover video with a tunable strength α. \n- Insert a differentiable distortion layer during training, including a learned 3D-CNN proxy for H.264 (CompressionNet), plus stochastic spatial and temporal perturbations (crop, blur, noise, frame drop/swap, hue/saturation, JPEG, shift).\n- Modify the decoder to produce per-scale logits via multiple heads and fuse them with a per-video, per-bit weighting matrix predicted by WeightNet; add a watermark detector head to localize watermarked frames.\n- Enforce perceptual quality and temporal consistency with a multiscale 3D video discriminator (hinge GAN) trained jointly with the encoder-decoder.\n\nKey_Mechanism:\n- The core insight is to distribute message energy across complementary spatial-temporal scales and to learn content-adaptive fusion of these scales, which increases redundancy against diverse video distortions while limiting visible artifacts. \n- Training through a stochastic differentiable distortion channel, including a learned codec proxy, optimizes the encoder-decoder pair for robustness to both differentiable and non-differentiable edits encountered in practice.\n- A 3D GAN discriminator biases the encoder toward temporally coherent, perceptually plausible residuals, reducing flicker relative to 2D alternatives.\n\nMathematical_Formulation:\n- Let Vin ∈ R^{T×H×W×3} be the cover video, M ∈ {0,1}^m the message bits. The encoder produces a residual R and watermarked video\n  \\[\n  R = \\mathcal{E}(V_{\\text{in}},\\,\\mathcal{T}(M));\\quad V_w = V_{\\text{in}} + \\alpha\\, R,\n  \\]\n  where \\(\\mathcal{T}(M)\\in\\mathbb{R}^{T\\times H\\times W\\times m}\\) tiles M over spatial-temporal dimensions and α>0 controls strength.\n- During training, a distortion operator \\(\\Phi\\) is sampled from a distribution \\(\\mathcal{D}\\) and applied to Vw:\n  \\[\n  V_d = \\Phi(V_w;\\,\\xi),\\quad \\Phi\\sim \\mathcal{D},\\ \\xi \\text{ distortion parameters; includes } \\Phi_{\\text{comp}}\\approx \\text{H.264} = \\mathcal{C}_{\\theta_c}(V_w).\n  \\]\n- The decoder extracts shared 3D features \\(D_f=\\mathcal{G}_{\\text{tr}}(V_d)\\). For heads i=1..k (k=2 here), produce per-bit spatio-temporal logits \\(D_i\\in\\mathbb{R}^{T_i\\times H_i\\times W_i\\times m}\\); apply global average pooling to obtain \\(e_{i}\\in\\mathbb{R}^{m}\\) with elements \\(e_{i,j}=\\text{GAP}(D_i[:,:,:,j])\\).\n  WeightNet predicts per-bit per-head weights \\(w_{i,j}\\) with softmax across i, and the final decoded logits are\n  \\[\n  \\hat m_j=\\sum_{i=1}^{k} w_{i,j}\\, e_{i,j},\\qquad \\hat{\\mathbf{m}}=\\sigma(\\hat{\\mathbf{m}}_{\\text{logits}}),\n  \\]\n  where σ is the sigmoid and decision is \\(\\hat{M}=\\mathbb{1}[\\hat{\\mathbf{m}}>0.5]\\).\n- Joint objective combines fidelity, message, and GAN losses with discriminator D:\n  \\[\n  \\min_{\\mathcal{E},\\mathcal{G}} \\mathbb{E}\\left[ \\underbrace{\\|V_w - V_{\\text{in}}\\|_2^2}_{L_I} + c_1\\, \\underbrace{\\text{BCE}(M,\\,\\hat{\\mathbf{m}})}_{L_M} + c_2\\, \\underbrace{(-D(V_w))}_{L_G}\\right],\n  \\]\n  \\[\n  \\min_D\\ \\mathbb{E}\\left[\\max(0,1-D(V_w)) + \\max(0,1 + D(V_{\\text{in}}))\\right].\n  \\]\n  The watermark detector predicts \\(p=\\sigma(\\mathcal{H}_{\\text{det}}(D_f))\\) with BCE against watermarked/unwatermarked labels.\n- Complexity summary (3D conv with kernel k_t×k_h×k_w): a layer with Cin→Cout has time O(T H W Cin Cout k_t k_h k_w) and parameters Cin Cout k_t k_h k_w. The multiscale path S2 reduces spatial cost roughly by 1/4 per 2× downsampling (temporal downsampling, if used, multiplies by an additional 1/2 factor).\n\nComputational_Properties:\n- Time Complexity:\n  - Encoder: O(Σ_l T H W C_{l-1} C_l k_t^{(l)} k_h^{(l)} k_w^{(l)}) for the 3D transform + embedding stacks. The S2 branch operates at ≈(H/2)×(W/2), reducing its layers by ≈4× vs. full-res.\n  - Distortion layer (training only): sum of selected augmentations; CompressionNet adds O(T H W Σ C k^3).\n  - Decoder: O(Σ_l T H W C_{l-1} C_l k^3) for the shared transform plus heads; head-1 includes internal 2× pooling in space/time to reduce compute; global average pooling and WeightNet are negligible O(mk).\n  - Discriminator (training only): four multiscale 3D branches; overall comparable to encoder-decoder cost, O(T H W · poly(C)).\n  - End-to-end training per step: encoder + distortions + decoder + discriminator ≈ 2–3× encoder cost; inference (embed or decode) omits discriminator and most distortions.\n- Space Complexity:\n  - Activations dominate: O(T H W Σ_l C_l) for encoder and decoder stacks; S2 paths reduce accordingly. The optional detector shares features and adds negligible memory overhead.\n  - Parameters: 3D conv weights across encoder/decoder/CompressionNet/discriminator; total scales linearly with Σ Cin Cout k^3. WeightNet adds O(mk) weights; negligible.\n- Parallelization:\n  - All convolutions, tiling, pooling, and elementwise ops are data-parallel and map efficiently to GPUs/TPUs. Heads run in parallel; multiscale discriminator branches parallelize across streams.\n  - The distortion sampler is embarrassingly parallel; CompressionNet is 3D-CNN and thus GPU-friendly. \n- Hardware Compatibility:\n  - Best on GPUs/TPUs due to 3D convolutional intensity and memory bandwidth demands. Mixed precision (FP16/bfloat16) is effective; symmetric padding avoids boundary artifacts without extra memory copies.\n  - CPU inference is feasible but slower; batched processing across clips or spatial tiles is supported by full-convolutional design.\n- Training vs. Inference:\n  - Training includes stochastic distortions, CompressionNet, and GAN; compute ~2–3× inference. \n  - Inference encoder (embedding) and decoder (recovery) are standalone; the detector can be invoked only when content mixing is suspected.\n- Parameter Count:\n  - For a 3D Conv layer: params = Cin Cout k_t k_h k_w. Encoder transform: 4 layers (kernels 1,1,1,3 temporally) with 64 channels; embedding S1 uses 3 convs (Cin≈64+m → 256 → 128 → 128). S2 path adds 3 convs at half spatial res (Cin≈128+m → 512 → 256 → 256) plus upsampling and fusion. Decoder mirrors this with a 4-layer transform and two heads (channel sequences 128,128,256,512 and 128,128,128,256). WeightNet is three 3D convs (32,64,128) with stride 2 and one FC with m×k outputs. Detector adds four 2D convs (128,128,256,512). Overall, parameters scale linearly in m through the first embedding/decoding layers that concatenate the tiled message.\n- Numerical Stability:\n  - Spectral normalization on the discriminator stabilizes GAN training; hinge loss avoids saturation. Sigmoid BCE for bits; apply logit clipping in implementation to avoid overflow. Symmetric padding in all 3D convs reduces boundary artifacts and temporal flicker. α controls watermark magnitude; tuning prevents over-embedding and gradient explosion.\n- Scaling Behavior:\n  - Fully convolutional in space; cost scales linearly with H·W. Temporally, training uses segments (e.g., T=8) for stability; inference can process longer videos by sliding windows; cost scales linearly with T. \n  - Payload m increases channel dimensions only in message-concatenation layers, yielding near-linear increases in compute/params for those layers; robustness degrades gracefully as m increases, mitigated by WeightNet’s adaptive fusion.\n- Implementation-critical details and pitfalls:\n  - Train CompressionNet first to approximate H.264 at target CRF (e.g., PSNR≈33 dB at CRF=25), then freeze in the distortion set.\n  - Sample one distortion per step uniformly from a diverse set (frame drop/swap, crop, hue/saturation, 3D blur, Gaussian noise, JPEG, temporal shift, CompressionNet) to prevent overfitting to any single perturbation.\n  - Use symmetric padding in all 3D convs to avoid boundary artifacts; zero-padding increases temporal inconsistency.\n  - At inference, α can be adjusted to navigate the quality–robustness trade-off without retraining; for long videos, process in T-frame segments and (optionally) re-use the same message across segments.\n  - For edited videos, run the detector to gate frames by confidence before decoding; improves decoding when watermarked content occupies a small spatio-temporal region.",
        "IMPLEMENTATION_GUIDANCE": "Integration_Strategy:\n- System architecture and module placement\n  - Insert an end-to-end DVMark pipeline with four modules in sequence for training: Encoder -> DistortionLayer -> Decoder (+ optional Detector) with an auxiliary VideoDiscriminator for GAN loss.\n  - At inference (embedding only): use Encoder, skip DistortionLayer, skip GAN and Decoder; optionally run Detector+Decoder for verification.\n  - Maintain the message path end-to-end (bit tensor repeated across T×H×W) in both encoder and decoder.\n- Encoder integration (replace/extend your current image-watermarking encoder)\n  - Replace 2D conv stacks with 3D Conv stacks to exploit temporal features.\n  - Transform layer: 4× Conv3D with channels=64, stride=1, kernel sizes: (kT,kH,kW) = (1,3,3), (1,3,3), (1,3,3), (3,3,3). Symmetric padding in T,H,W.\n  - Embedding layer: two-scale fusion\n    - Scale S1: Concatenate features with message block (shape T×H×W×m) along channel dimension; apply Conv3D with channels 256 → 128 → 128, kernel 3.\n    - Scale S2: AvgPool3D 2× downsample on S1 feature map; concatenate message; Conv3D with channels 512 → 256 → 256; bilinear upsample back to S1 and fuse (e.g., sum or concat+1×1×1 Conv3D).\n  - Output residual R; watermarked Vw = Vin + α · R, with clamping to valid range after addition (e.g., [0,1]).\n- Decoder integration\n  - Separate transform layer (do not share weights with encoder): same spec as encoder transform (4× Conv3D: 64 channels, temporal kernels 1,1,1,3).\n  - Multi-head decoder (2 heads):\n    - Head1: 4× Conv3D with outputs 128, 128, 256, 512; apply 2× average pooling in both spatial and temporal dims for the last two layers.\n    - Head2: 4× Conv3D with outputs 128, 128, 128, 256; no temporal downsampling.\n    - For each head i, produce Di ∈ R(Ti×Hi×Wi×m); apply global average pooling over (T,H,W) → Ei ∈ Rm.\n    - WeightNet (per-video): 3× Conv3D (channels 32, 64, 128; stride 2); global average pool; FC with m×2 units; softmax across the 2 heads per bit to produce W ∈ R(m×2). Final bit logits: Mw[j] = Σi W[j,i] · Ei[j].\n- Watermark detector integration (optional but recommended)\n  - Take the shared decoder transform features Df; add detector head with 4× Conv2D (3×3) channels 128, 128, 256, 512; global average pool over (T,H,W); sigmoid for “watermarked” probability per video or per-frame (if you pool over H,W only).\n  - Use detector prefiltering threshold τ ∈ [0.25, 0.5] (paper used 0.3) before decoding in mixed-content videos.\n- DistortionLayer (training only)\n  - Sample exactly one distortion uniformly per step from:\n    - CompressionNet (proxy for H.264 CRF=25)\n    - Frame drop p=0.5\n    - Frame swap p=0.5\n    - Spatial crop p=0.5 (random box, aspect preserved)\n    - Saturation jitter (e.g., factor ∈ [0.7, 1.3])\n    - Hue jitter (e.g., delta ∈ [-0.1, 0.1] in HSV)\n    - 3D Gaussian blur σ=2.0 (spatial k=5, temporal k=3)\n    - Gaussian noise std=0.05\n    - Differentiable JPEG q=50 (with chroma subsampling)\n    - Frame shift (cyclic permutation)\n- Video discriminator (TGAN2-like)\n  - Four parallel 3D-ResNets, each receives a different spatial-temporal resolution of Vw (downsample input with strided convs or pooling).\n  - Each subnetwork: 4 residual 3D conv layers with parameters:\n    - ResBlock1 channels (32,64,128,256), spatial strides (2,2,2,2), temporal (1,1,1,1)\n    - ResBlock2 channels (32,64,128,256), spatial strides (2,2,2,2), temporal (2,1,1,1)\n    - ResBlock3 channels (32,64,128,256), spatial strides (2,2,2,1), temporal (2,2,1,1)\n    - ResBlock4 channels (32,64,128,256), spatial strides (2,2,1,1), temporal (2,2,2,1)\n  - Residual unit: 3×3×3 conv + 1×1×1 shortcut; spectral normalization on all discriminator convs.\n  - Global pool over (T,H,W); FC to logits; sum logits from all scales.\n- CompressionNet integration\n  - 7-layer Conv3D with channels [64,64,64,128,128,128,64], kernel 3; one downsample in the middle, then upsample; residual from input to output.\n  - Train standalone to mimic H.264 CRF=25; freeze during DVMark training.\n- Code-level notes and framework compatibility\n  - PyTorch: use NCTHW; keep tensors as float32 in [0,1]. Symmetric padding not native: implement via F.pad with mode='reflect' on (W,H,T).\n  - TensorFlow: use channels-last (NT H W C) or channels-first with tf.keras.layers.Conv3D; ensure padding='same' with reflection padding via tf.pad + Lambda.\n  - JAX/Flax: implement ConvGeneralDilated; add custom reflection padding function; use vmap/pmap for multi-device.\n  - Losses: L2(Vin,Vw) + c1·BCEWithLogits(Mw, M) + c2·GAN_Hinge. Train encoder+decoder jointly; train discriminator with 2 D-steps per G-step.\n- Migration path from image watermarking\n  - Replace 2D Conv blocks with 3D Conv blocks; extend message broadcast to T dimension.\n  - Add DistortionLayer with temporal ops; add video discriminator; keep BCE loss on message.\n  - If you have a JPEG proxy, keep it; add CompressionNet for video compression.\n- Dependencies and kernels\n  - Requires efficient 3D convolutions (cuDNN >= 8.0); mixed precision highly recommended.\n  - Differentiable JPEG: use existing libs (e.g., Kornia, CompressAI ops) or implement DCT/IDCT; ensure fp16 stability with clamping.\n- Training pipeline integration\n  - Data loader: sample clips of 8×128×128 (T×H×W) by default; normalize to [0,1]; optionally random horizontal flip.\n  - Message sampler: sample m-bit vector per clip (m default 96), Bernoulli(0.5).\n  - Temporal segmentation for large videos at inference: process non-overlapping 8-frame windows with same message, or overlap by 4 frames to reduce seams; concatenate temporally.\n\nParameter_Settings:\n- Core hyperparameters (defaults from paper)\n  - T×H×W: 8×128×128 during training; works for higher resolutions at inference.\n  - Message length m: 96 (robust). Practical ranges:\n    - 32–64: highest robustness and quality\n    - 96: strong overall trade-off\n    - 112–128: increased payload; expect 2–6% lower average bit accuracy under strong distortions\n  - Watermark strength α: train at 1.0; inference adjust 0.6–1.4\n    - Lower α (0.6–0.9): +0.5–1.5 dB PSNR, −2–6% robustness\n    - Higher α (1.1–1.4): −0.5–1.5 dB PSNR, +2–6% robustness\n- Optimization\n  - Optimizer: Adam (β1=0.9, β2=0.999, ε=1e-8)\n  - LR: 1e-4 with exponential decay factor 0.8 every 200k steps\n  - Steps: 3M generator steps; discriminator steps per G-step: N=2\n  - Batch size: 6 clips (8×128×128) on ~16–24 GB GPUs; scale per memory\n  - Loss weights: c1 (message) = 0.5; c2 (GAN) = 4e-3\n    - c1 ∈ [0.3, 0.7]: higher c1 increases robustness at cost of PSNR (e.g., c1=0.7 → +2% acc, −2.6 dB PSNR vs c1=0.5)\n    - c2 ∈ [2e-3, 6e-3]: lower c2 increases noise artifacts; higher c2 improves temporal consistency but can reduce message accuracy slightly\n- Initialization\n  - Conv layers: Kaiming normal (fan_out) for 3D convs; biases = 0\n  - Final residual output conv: initialize weights with std 1e-3 to keep early α·R small\n  - WeightNet FC: Xavier uniform; bias zeros; apply softmax temperature τ in [0.8, 1.2] if heads collapse\n- Distortion parameters\n  - CompressionNet CRF target: 25 (train proxy); optional multi-CRF training: sample CRF ∈ {22,25,28} and train a small Mixture-of-Experts CompressionNet; expect +1–2% robustness on real H.264 across CRF 22–28.\n  - Gaussian noise std: 0.04–0.06 during robustness eval; train at 0.05\n  - Frame drop: p ∈ [0.3, 0.7] for stress testing; train at 0.5\n  - Spatial crop: p ∈ [0.3, 0.8]; train at 0.5\n- Critical vs robust parameters\n  - Critical: α, c1, distortion sampling distribution, symmetric padding choice, spectral normalization on discriminator\n  - Robust: number of channels in transform layer (can be 48–80), choice of bilinear vs nearest upsampling for S2 (minor impact)\n- Scale-dependent settings\n  - Higher resolutions (≥480p): keep network identical; process in tiles or full-frame; if tiling, overlap by 16–32 pixels and alpha-blend to avoid seams\n  - Longer windows (T=16): if memory allows, increase T; otherwise keep T=8 but overlap windows\n- Hardware-dependent settings\n  - FP16 AMP: enabled on Ampere/Hopper for 1.5–2.0× speed; keep BCE logits in fp32 to avoid underflow (cast before loss)\n  - Gradient accumulation: use to emulate batch size 6 if memory < 16 GB; accumulate 2–4 steps\n  - cuDNN benchmark: enable for stable input sizes; set torch.backends.cudnn.benchmark=True\n  - Spectral normalization: update power iteration steps=1 per forward; cache buffers on GPU to reduce CPU-GPU sync\n\nApplication_Conditions:\n- Beneficial scenarios\n  - Videos subject to mixed real-world edits: compression (H.264/AVC at CRF 22–28), cropping (≥40% retained), color shifts, noise, frame dropping/swapping\n  - Payload requirements up to 96–128 bits per clip with high retrieval accuracy\n  - Need for detector to localize short watermarked segments embedded into long unwatermarked timelines (e.g., commentary, compilations)\n- Hardware requirements\n  - Training: ≥16 GB GPU memory per process for batch size 6 at 8×128×128; for 2× larger H/W or T=16, ≥24–40 GB recommended\n  - Inference (embedding only): 8–12 GB suffices for 1080p if tiled; real-time embedding achievable on RTX 4090 or A100 with AMP\n- Scale considerations\n  - Model becomes advantageous over image-based methods as soon as T≥4 and edits include temporal distortions (frame drops/swaps/averages)\n  - For very small clips (T≤3) or single images, prefer image watermarking (e.g., HiDDeN/StegaStamp)\n- Task compatibility\n  - Most robust on natural videos with moderate motion and texture; less robust on uniform, low-texture, or heavily blurred content\n  - Neutral or weaker in tasks requiring zero temporal change tolerance (e.g., strict frame-by-frame identical pipelines), where per-frame image watermarking may suffice\n- Alternative comparisons and when to choose\n  - Choose DVMark over traditional DWT/DCT for multi-distortion robustness; DWT can be slightly better under extremely heavy Gaussian noise only\n  - Choose DVMark over pure image watermarking for temporal robustness (frame operations, temporal filtering) and higher temporal consistency\n- Resource constraints\n  - If compute-limited, consider:\n    - Reducing channels by 25% (64→48) with ~1–2% accuracy drop\n    - Training without GAN (c2=0) to halve compute; expect more visible noise and +0.2–0.4 tLP degradation\n\nExpected_Outcomes:\n- Performance improvements (vs baselines, representative)\n  - Average bit accuracy across diverse distortions: ~98.1% (Table 1), +6–8% over image baseline and +7–8% over 3D-DWT at similar PSNR\n  - Under H.264 CRF=22: ~92.9% (±1%); under frame drop p=0.5: ~99.0%; under crop p=0.5: ~97.1%; under noise std=0.04: ~98.6%\n  - Quality metrics at α≈1.0: PSNR ≈ 37.0 dB, MSSIM ≈ 0.985, LPIPS×100 ≈ 5.7, tLP×100 ≈ 0.16; MOS “same” ≈ 0.92\n- Timeline expectations\n  - Early training (≤300k steps): decoder accuracy on identity rises >95%; robustness to compression lags until CompressionNet overfits well\n  - Full robustness requires ≥1M steps; temporal consistency from GAN improves steadily after 200–400k steps\n- Trade-offs\n  - Increasing payload (96→128 bits) reduces average accuracy by ~6%; lowering α improves PSNR by 0.5–1.5 dB but reduces robustness by 2–6%\n  - Removing GAN loss speeds training ~1.3× but increases flicker (tLP worsens by ~0.2×10^-2) and visible noise\n- Benchmark comparisons\n  - At fixed PSNR ≈ 37 dB, expect +8–12% average accuracy over image watermarking across H.264, crop, frame drop, noise\n  - Payload scaling: at 64 bits with PSNR ~37 dB, expect ~98% average accuracy; at 128 bits expect ~90–92% with α tuned\n- Failure modes\n  - Very low-texture/low-motion or heavy blur videos: accuracy can drop to 50–80% under strong distortions (see histogram tails)\n  - Out-of-range distortions not seen in training (e.g., CRF≥30, extreme crops <30% area, aggressive temporal resampling) degrade performance\n  - GAN instability without spectral norm or with high c2 (>8e-3) may reduce message accuracy (collapse of heads or artifacting)\n  - Padding errors (zero-padding instead of reflection) cause boundary artifacts and flicker; bit accuracy may degrade at first/last frames\n- Debugging indicators and validation\n  - Sanity checks:\n    - Identity path: ≥99% bit accuracy within first 50k steps\n    - With only Gaussian noise (std=0.04): ≥97% by 500k steps\n    - WeightNet head weights: per-bit softmax should not collapse to a single head for all bits; monitor entropy ∈ [0.3, 0.7]\n    - Detector ROC-AUC >0.98 on clean vs watermarked clips; with distortions, expect ≥0.95\n  - Visual checks:\n    - Difference maps localized and low-magnitude; temporal flicker low (tLP×100 ≤ 0.2)\n  - Compression proxy fidelity: PSNR between CompressionNet(V) and H.264(V,CRF=25) ≈ 33 dB; if <31 dB, retrain or regularize\n- Hardware-specific outcomes\n  - Ampere/Hopper with AMP: 1.5–2.0× speedup; memory reduction ~30–40%; ensure loss computations in fp32 to avoid underflow\n  - Consumer GPUs (RTX 3090, 24 GB): batch size 6–8 feasible; real-time encoding at 1080p with tiling at ~30–60 fps\n  - CPUs only: training impractical; inference embedding possible but slow; use ONNX/TensorRT for deployment acceleration\n\nQuality Requirements:\n- Troubleshooting common issues\n  - Low accuracy across all distortions: check α scaling/clamping; verify message repetition shape and channel concat order; ensure BCEWithLogits used, not BCE\n  - Good identity accuracy but poor compression robustness: verify CompressionNet weights are frozen and distortion is sampled uniformly; increase its sampling probability to 0.3–0.5 temporarily\n  - Temporal flicker: confirm reflection padding; ensure 3D discriminator is active (c2>0) and spectral normalization applied\n  - Detector over-filtering: adjust threshold τ from 0.5 → 0.3; train with stronger distortions; add focal loss to improve calibration\n- Validation procedures\n  - Compute bit accuracy over a 500-clip validation set under a battery of distortions: H.264 CRF {22,25,28}, crop p {0.4,0.5,0.6}, frame drop p {0.3,0.5}, noise std {0.04,0.06}\n  - Quality metrics on identity: PSNR, MSSIM, LPIPS, tLP; target PSNR ≥ 36.5 dB, tLP×100 ≤ 0.2\n  - Detector evaluation: mix 50% watermarked segments into long unwatermarked videos; target precision/recall ≥ 0.95 with τ≈0.3; confirm large-gain decoding when filtering (e.g., +20–40% accuracy vs no filtering on long backgrounds)\n- Software/hardware specifics\n  - PyTorch 2.0+, CUDA 11.8+, cuDNN 8.7+ recommended; enable torch.compile for potential speedups on 3D convs\n  - Mixed precision: use GradScaler; cast CompressionNet and DistortionLayer to fp16-safe ranges; clamp after noise/JPEG ops\n  - Multi-GPU: use DDP with gradient accumulation; seed message generator per-rank for reproducibility\n- Directly applicable settings\n  - Start with: m=96, α=1.0, batch=6, LR=1e-4 decay 0.8/200k, steps=3M, c1=0.5, c2=4e-3, N_D=2\n  - Inference for 1080p: tile into 256–384 px patches with 32 px overlap; T=8 windows; α=0.9–1.1; detector τ=0.3 for mixed-content streams\n  - Robustness sweep: export models with α ∈ {0.8,1.0,1.2} to support application-specific trade-offs without retraining"
    }
]